app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		#  When you pass the :show argument to the resources method,
		# it will automatically create the show route
		# the show route will assume that you will need to pass the id into the URL string
		# Whenever you have id parameters listed in the path like this,
		# you will need to pass the route helper method an ID
		@post = Post.find(params[:id])